{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"conv2d_Conv2D15","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization13","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization13","trainable":true},"inbound_nodes":[[["conv2d_Conv2D15",0,0,{}]]]},{"name":"conv2d_Conv2D16","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D16","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization13",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization14","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization14","trainable":true},"inbound_nodes":[[["conv2d_Conv2D16",0,0,{}]]]},{"name":"average_pooling2d_AveragePooling2D2","class_name":"AveragePooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"average_pooling2d_AveragePooling2D2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization14",0,0,{}]]]},{"name":"conv2d_Conv2D17","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D17","trainable":true},"inbound_nodes":[[["average_pooling2d_AveragePooling2D2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization15","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization15","trainable":true},"inbound_nodes":[[["conv2d_Conv2D17",0,0,{}]]]},{"name":"conv2d_Conv2D18","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D18","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization15",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization16","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization16","trainable":true},"inbound_nodes":[[["conv2d_Conv2D18",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D3","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization16",0,0,{}]]]},{"name":"conv2d_Conv2D19","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D19","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization17","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization17","trainable":true},"inbound_nodes":[[["conv2d_Conv2D19",0,0,{}]]]},{"name":"conv2d_Conv2D20","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D20","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization17",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization18","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization18","trainable":true},"inbound_nodes":[[["conv2d_Conv2D20",0,0,{}]]]},{"name":"conv2d_Conv2D21","class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D21","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization18",0,0,{}]]]}],"input_layers":[["input3",0,0]],"output_layers":[["conv2d_Conv2D21",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./denoising-autoencoder.weights.bin"],"weights":[{"name":"conv2d_Conv2D15/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"conv2d_Conv2D15/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D16/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2d_Conv2D16/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D17/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D17/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D18/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"conv2d_Conv2D18/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D19/kernel","shape":[3,3,128,64],"dtype":"float32"},{"name":"conv2d_Conv2D19/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D20/kernel","shape":[3,3,64,32],"dtype":"float32"},{"name":"conv2d_Conv2D20/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D21/kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"conv2d_Conv2D21/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_variance","shape":[32],"dtype":"float32"}]}]}