{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"shared_conv1","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"shared_conv1","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"shared_bn1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"shared_bn1","trainable":true},"inbound_nodes":[[["shared_conv1",0,0,{}]]]},{"name":"shared_conv2","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"shared_conv2","trainable":true},"inbound_nodes":[[["shared_bn1",0,0,{}]]]},{"name":"shared_bn2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"shared_bn2","trainable":true},"inbound_nodes":[[["shared_conv2",0,0,{}]]]},{"name":"max_pool","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pool","trainable":true},"inbound_nodes":[[["shared_bn2",0,0,{}]]]},{"name":"avg_pool","class_name":"AveragePooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"avg_pool","trainable":true},"inbound_nodes":[[["shared_bn2",0,0,{}]]]},{"name":"max_conv1","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"max_conv1","trainable":true},"inbound_nodes":[[["max_pool",0,0,{}]]]},{"name":"avg_conv1","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"avg_conv1","trainable":true},"inbound_nodes":[[["avg_pool",0,0,{}]]]},{"name":"max_bn1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"max_bn1","trainable":true},"inbound_nodes":[[["max_conv1",0,0,{}]]]},{"name":"avg_bn1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"avg_bn1","trainable":true},"inbound_nodes":[[["avg_conv1",0,0,{}]]]},{"name":"max_conv2","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"max_conv2","trainable":true},"inbound_nodes":[[["max_bn1",0,0,{}]]]},{"name":"avg_conv2","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"avg_conv2","trainable":true},"inbound_nodes":[[["avg_bn1",0,0,{}]]]},{"name":"max_bn2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"max_bn2","trainable":true},"inbound_nodes":[[["max_conv2",0,0,{}]]]},{"name":"avg_bn2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"avg_bn2","trainable":true},"inbound_nodes":[[["avg_conv2",0,0,{}]]]},{"name":"max_upsample","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"max_upsample","trainable":true},"inbound_nodes":[[["max_bn2",0,0,{}]]]},{"name":"avg_upsample","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"avg_upsample","trainable":true},"inbound_nodes":[[["avg_bn2",0,0,{}]]]},{"name":"max_conv3","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"max_conv3","trainable":true},"inbound_nodes":[[["max_upsample",0,0,{}]]]},{"name":"avg_conv3","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"avg_conv3","trainable":true},"inbound_nodes":[[["avg_upsample",0,0,{}]]]},{"name":"max_bn3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"max_bn3","trainable":true},"inbound_nodes":[[["max_conv3",0,0,{}]]]},{"name":"avg_bn3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"avg_bn3","trainable":true},"inbound_nodes":[[["avg_conv3",0,0,{}]]]},{"name":"max_output","class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"max_output","trainable":true},"inbound_nodes":[[["max_bn3",0,0,{}]]]},{"name":"avg_output","class_name":"Conv2D","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"sigmoid","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"avg_output","trainable":true},"inbound_nodes":[[["avg_bn3",0,0,{}]]]}],"input_layers":[["input3",0,0]],"output_layers":[["max_output",0,0],["avg_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./dual-pooling-autoencoder.weights.bin"],"weights":[{"name":"shared_conv1/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"shared_conv1/bias","shape":[32],"dtype":"float32"},{"name":"shared_bn1/gamma","shape":[32],"dtype":"float32"},{"name":"shared_bn1/beta","shape":[32],"dtype":"float32"},{"name":"shared_conv2/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"shared_conv2/bias","shape":[64],"dtype":"float32"},{"name":"shared_bn2/gamma","shape":[64],"dtype":"float32"},{"name":"shared_bn2/beta","shape":[64],"dtype":"float32"},{"name":"max_conv1/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"max_conv1/bias","shape":[128],"dtype":"float32"},{"name":"avg_conv1/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"avg_conv1/bias","shape":[128],"dtype":"float32"},{"name":"max_bn1/gamma","shape":[128],"dtype":"float32"},{"name":"max_bn1/beta","shape":[128],"dtype":"float32"},{"name":"avg_bn1/gamma","shape":[128],"dtype":"float32"},{"name":"avg_bn1/beta","shape":[128],"dtype":"float32"},{"name":"max_conv2/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"max_conv2/bias","shape":[128],"dtype":"float32"},{"name":"avg_conv2/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"avg_conv2/bias","shape":[128],"dtype":"float32"},{"name":"max_bn2/gamma","shape":[128],"dtype":"float32"},{"name":"max_bn2/beta","shape":[128],"dtype":"float32"},{"name":"avg_bn2/gamma","shape":[128],"dtype":"float32"},{"name":"avg_bn2/beta","shape":[128],"dtype":"float32"},{"name":"max_conv3/kernel","shape":[3,3,128,64],"dtype":"float32"},{"name":"max_conv3/bias","shape":[64],"dtype":"float32"},{"name":"avg_conv3/kernel","shape":[3,3,128,64],"dtype":"float32"},{"name":"avg_conv3/bias","shape":[64],"dtype":"float32"},{"name":"max_bn3/gamma","shape":[64],"dtype":"float32"},{"name":"max_bn3/beta","shape":[64],"dtype":"float32"},{"name":"avg_bn3/gamma","shape":[64],"dtype":"float32"},{"name":"avg_bn3/beta","shape":[64],"dtype":"float32"},{"name":"max_output/kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"max_output/bias","shape":[1],"dtype":"float32"},{"name":"avg_output/kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"avg_output/bias","shape":[1],"dtype":"float32"},{"name":"shared_bn1/moving_mean","shape":[32],"dtype":"float32"},{"name":"shared_bn1/moving_variance","shape":[32],"dtype":"float32"},{"name":"shared_bn2/moving_mean","shape":[64],"dtype":"float32"},{"name":"shared_bn2/moving_variance","shape":[64],"dtype":"float32"},{"name":"max_bn1/moving_mean","shape":[128],"dtype":"float32"},{"name":"max_bn1/moving_variance","shape":[128],"dtype":"float32"},{"name":"avg_bn1/moving_mean","shape":[128],"dtype":"float32"},{"name":"avg_bn1/moving_variance","shape":[128],"dtype":"float32"},{"name":"max_bn2/moving_mean","shape":[128],"dtype":"float32"},{"name":"max_bn2/moving_variance","shape":[128],"dtype":"float32"},{"name":"avg_bn2/moving_mean","shape":[128],"dtype":"float32"},{"name":"avg_bn2/moving_variance","shape":[128],"dtype":"float32"},{"name":"max_bn3/moving_mean","shape":[64],"dtype":"float32"},{"name":"max_bn3/moving_variance","shape":[64],"dtype":"float32"},{"name":"avg_bn3/moving_mean","shape":[64],"dtype":"float32"},{"name":"avg_bn3/moving_variance","shape":[64],"dtype":"float32"}]}]}